Revit 2016 API
Grid.Create Method (Document, Arc)
 Creates a new radial grid line.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public static Grid Create(
	Document document,
	Arc arc
)
Visual Basic
Public Shared Function Create ( _
	document As Document, _
	arc As Arc _
) As Grid
Visual C++
public:
static Grid^ Create(
	Document^ document,
	Arc^ arc
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document in which the new instance is created.
arc
Type: Autodesk.Revit.DB.Arc
 An arc object that represents the location of the new grid line.
Return Value
 The newly created grid line.
Remarks
 The arc should be on a horizontal plane.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  document is not a project document. -or- The input arc is not on horizontal plane.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
Grid Class
Create Overload
Autodesk.Revit.DB Namespace